/*
  Розглянемо функцію, що працює із завчасно відомим типом даних.
  Вже під час визначення цієї функції, ми точно знаємо, з яким типом даних
  вона працює, тому у нас не виникає жодних проблем із її типізацією.
*/

function double(n: number): number {
  return n * 2;
}

/*
  Але, що, якщо наша функція повинна вміти працювати із параметром будь-якого типу?
  В нашому прикладі, функція `identity`, запланована так, що повинна працювати із аргументом будь якого типу.
  Ми використали тип `any` і це спрацювало, але, таким чином, ми вимкнули статичну типізацію для цього значення.
  TypeScrip компілятор в цьому конкретному місці не буде аналізувати наш код, ми втрачаємо повідомлення про
  помилки типів та автокомпліт.
*/

function identity(item: any): any {
  return item;
}

const num = identity(1);
// Не зважаючи на те, що під час виклику ми передали параметр конкретного типу, все одно отримуємо тип `any`

/*
  В JavaScript такої проблеми не існує, адже типізація там динамічна, а не статична.
  Проте, як наслідок, немає жодних гарантій, що наш параметр отримає значення
  правильного типу і код не впаде з помилкою в рантаймі.
*/
