/*
  Для вирішення цієї пробелеми у TypeScript існують параметри типу (type parameters).
*/

function identity(item: any): any {
  return item;
}

const one = identity(1);
const two = identity("two");

/*
  Наша функція перетворюється в так звану джинерік функцію (generic function).
  В перекладі з англійської generic означає - загальний або універсальний, тобто
  джинерік функція може працювати із даними певного загального типу, точний тип яких
  стане відомим під час виклику функції.
*/

/*
  `T` в нашому прикладі вище виступає як плейсхолдер для невідомого типу.
  Ми говоримо компілятору наступне: Ми, покищо, не знаємо, який тип буде
  у параметрі item, але ми точно знаємо, що що він буде співпадати із типом
  значення, яке це функція поверне. Цей тип буде визначено в момент виклику
  функції, але взаємозвязки типів всередині функції ми можемо визначити
  наперед, використовуючи плейсхолдер T.
*/

function repeat(item: any, times: number): any {
  return Array(times).fill(item);
}

function concat(a: any, b: any): any {
  return [...a, ...b];
}

/*
  Ментальна модель наступна:

  Ми не знаємо типи значень завчасно, але ми знаємо структуру звязків між вхідними
  та вихідними значеннями функції і можемо їх описати за допомогою параметрів типу,
  які виступають в ролі плейсхолдерів.
*/
